# Module 1 - Manipulating data with Pandas (continued)
## Pandas Part 2

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)

## Scenario:
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. In this lecture, we are continue to look at a real data set collected by [Austin Animal Center](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm) over several years and use our Pandas skills from last class and learn some new ones in order to explore this data further.

#### *Our goals today are to be able to*:  

Use the pandas library to:

- Get summary info about a dataset and its variables
  - Apply and use info, describe and dtypes
  - Use `mean`, `min`, `max`, and `value_counts` 
- Use `apply` and `applymap` to transform columns and create new values

- Explain lambda functions and use them to use an apply on a DataFrame
- Explain what a `groupby` object is and split a DataFrame using `groupby`
- Reshape a DataFrame using joins, merges, pivoting, stacking, and melting

## Getting started

Before we look at the animal shelter data, let's practice on a simpler dataset.
Read about this dataset here: https://www.kaggle.com/ronitf/heart-disease-uci
![heart-data](images/heartbloodpres.jpeg)

The dataset is most often used to practice classification algorithms. Can one develop a model to predict the likelihood of heart disease based on other measurable characteristics? We will return to that specific question in a few weeks, but for now we wish to use the dataset to practice some pandas methods.

### 1. Get summary info about a dataset and its variables

Applying and using `info`, `describe`, `mean`, `min`, `max`, `apply`, and `applymap` from the Pandas library

The Pandas library has several useful tools built in. Let's explore some of them.

In [2]:
!pwd
!ls -al data

/Users/enkeboll/code/fis/hbs-ds-060121/module-1/day-6-pandas-2
total 24
drwxr-xr-x  3 enkeboll  staff     96 Jan 14 10:46 .
drwxr-xr-x  7 enkeboll  staff    224 Jun  8 10:43 ..
-rwxr-xr-x  1 enkeboll  staff  11328 Dec 30 11:09 heart.csv

In [3]:
import pandas as pd
uci = pd.read_csv('data/heart.csv')

In [5]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

#### The `.columns` and `.shape` Attributes

In [6]:
uci.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [7]:
uci.shape

(303, 14)

In [8]:
uci.size

4242

#### The `.info() `and `.describe()` and `.dtypes` methods

Pandas DataFrames have many useful methods! Let's look at `.info()` , `.describe()`, and `dtypes`.

In [9]:
# Call the .info() method on our dataset. What do you observe?

uci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
age         303 non-null int64
sex         303 non-null int64
cp          303 non-null int64
trestbps    303 non-null int64
chol        303 non-null int64
fbs         303 non-null int64
restecg     303 non-null int64
thalach     303 non-null int64
exang       303 non-null int64
oldpeak     303 non-null float64
slope       303 non-null int64
ca          303 non-null int64
thal        303 non-null int64
target      303 non-null int64
dtypes: float64(1), int64(13)
memory usage: 33.3 KB

In [10]:
# Call the .describe() method on our dataset. What do you observe?

uci.describe()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000

In [11]:
# Use the code below. How does the output differ from info() ?
uci.dtypes

age           int64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

#### `.mean()`, .`min()`,` .max()`, `.sum()`

The methods `.mean()`, `.min()`, and `.max()` will perform just the way you think they will!

Note that these are methods both for Series and for DataFrames.

In [24]:
uci.shape

(303, 14)

#### The Axis Variable

In [33]:
uci.median(axis=1) # Try [shift] + [tab] here!

0      1.0
1      1.5
2      1.2
3      1.0
4      1.0
      ...
298    1.0
299    1.1
300    1.5
301    1.0
302    1.0
Length: 303, dtype: float64

#### .`value_counts()`

For a DataFrame _Series_, the `.value_counts()` method will tell you how many of each value you've got.

In [39]:
age = uci.age

In [40]:
type(age)

pandas.core.series.Series

In [56]:
uci.age.value_counts(ascending=True, ).index

Int64Index([29, 74, 76, 77, 37, 34, 38, 69, 71, 40, 70, 68, 35, 39, 47, 49, 46,
            48, 50, 66, 43, 65, 61, 53, 42, 45, 55, 67, 63, 41, 64, 56, 60, 44,
            62, 51, 52, 59, 54, 57, 58],
           dtype='int64')

In [61]:
age_counts = pd.DataFrame(uci.age.value_counts())
age_counts.columns = ['count']
age_counts = age_counts.reset_index()
age_counts = age_counts.rename(columns={'index': 'age'})
age_counts

    age  count
0    58     19
1    57     17
2    54     16
3    59     14
4    52     13
5    51     12
6    62     11
7    44     11
8    60     11
9    56     11
10   64     10
11   41     10
12   63      9
13   67      9
14   55      8
15   45      8
16   42      8
17   53      8
18   61      8
19   65      8
20   43      8
21   66      7
22   50      7
23   48      7
24   46      7
25   49      5
26   47      5
27   39      4
28   35      4
29   68      4
30   70      4
31   40      3
32   71      3
33   69      3
34   38      3
35   34      2
36   37      2
37   77      1
38   76      1
39   74      1
40   29      1

Exercise: What are the different values for restecg?

In [42]:
# Your code here!
uci.restecg.value_counts()

1    152
0    147
2      4
Name: restecg, dtype: int64

In [55]:
uci['restecg'].value_counts()

1    152
0    147
2      4
Name: restecg, dtype: int64

In [50]:
uci.restecg.unique()

array([0, 1, 2])

In [44]:
uci.newcol = 2

In [46]:
uci['newcol'] = 2

In [47]:
uci

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,newcol
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1,2
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1,2
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1,2
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1,2
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0,2
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0,2
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0,2
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0,2
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0,2

### Apply to Animal Shelter Data
Using `.info()` and `.describe()` and `dtypes` what observations can we make about the data?

What are the breed value counts?

How about age counts for dogs?

In [62]:
animal_outcomes = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')

In [63]:
animal_outcomes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 118000 entries, 0 to 117999
Data columns (total 12 columns):
Animal ID           118000 non-null object
Name                81031 non-null object
DateTime            118000 non-null object
MonthYear           118000 non-null object
Date of Birth       118000 non-null object
Outcome Type        117992 non-null object
Outcome Subtype     53642 non-null object
Animal Type         118000 non-null object
Sex upon Outcome    117996 non-null object
Age upon Outcome    117948 non-null object
Breed               118000 non-null object
Color               118000 non-null object
dtypes: object(12)
memory usage: 10.8+ MB

In [64]:
animal_outcomes.describe()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
count,118000,81031,118000,118000,118000,117992,53642,118000,117996,117948,118000,118000
unique,105483,18947,97241,97241,6852,9,22,5,5,50,2571,585
top,A721033,Max,04/18/2016 12:00:00 AM,04/18/2016 12:00:00 AM,09/01/2015,Adoption,Partner,Dog,Neutered Male,1 year,Domestic Shorthair Mix,Black/White
freq,33,531,39,39,117,51976,29271,67130,41427,21236,30780,12401

In [65]:
animal_outcomes.Name.value_counts()[:10]

Max         531
Bella       499
Luna        461
Rocky       358
Daisy       345
Princess    328
Charlie     316
Coco        310
Lucy        304
Blue        297
Name: Name, dtype: int64

What are the breed `value_counts`?
What's the top breed for adopted dogs?

How about outcome counts for dogs?

In [66]:
animal_outcomes.Breed.value_counts()

Domestic Shorthair Mix               30780
Pit Bull Mix                          8305
Labrador Retriever Mix                6645
Chihuahua Shorthair Mix               6174
Domestic Shorthair                    5229
                                     ...
Pomeranian/Cocker Spaniel                1
Border Terrier/Dachshund Wirehair        1
Beagle/Boston Terrier                    1
Rottweiler/Dachshund                     1
Alaskan Husky/Miniature Pinscher         1
Name: Breed, Length: 2571, dtype: int64

In [67]:
animal_outcomes.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A794011,Chunk,05/08/2019 06:20:00 PM,05/08/2019 06:20:00 PM,05/02/2017,Rto-Adopt,NaN,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Brown Tabby/White
1,A776359,Gizmo,07/18/2018 04:02:00 PM,07/18/2018 04:02:00 PM,07/12/2017,Adoption,NaN,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown
2,A720371,Moose,02/13/2016 05:59:00 PM,02/13/2016 05:59:00 PM,10/08/2015,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
3,A674754,NaN,03/18/2014 11:47:00 AM,03/18/2014 11:47:00 AM,03/12/2014,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby
4,A689724,*Donatello,10/18/2014 06:52:00 PM,10/18/2014 06:52:00 PM,08/01/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black

In [68]:
animal_outcomes['Animal Type'].unique()

array(['Cat', 'Dog', 'Other', 'Bird', 'Livestock'], dtype=object)

In [83]:
0b1000 | 0b111 # 0b1111

15

In [77]:
(animal_outcomes['Animal Type'] == 'Dog') & (animal_outcomes['Outcome Type'] == 'Adoption')

0         False
1          True
2          True
3         False
4         False
          ...
117995    False
117996    False
117997     True
117998    False
117999     True
Length: 118000, dtype: bool

In [84]:
animal_outcomes.loc[(animal_outcomes['Animal Type'] == 'Dog') & (animal_outcomes['Outcome Type'] == ' Adoption'), 'Breed'].value_counts()[0:1]

Series([], Name: Breed, dtype: int64)

In [101]:
testdf = pd.DataFrame([[1,3,4], [2, None, 4]])
testdf.sum(skipna=False)

0    3.0
1    NaN
2    8.0
dtype: float64

In [75]:
animal_outcomes.loc[(animal_outcomes['Animal Type'] == 'Dog') &
                    (animal_outcomes['Outcome Type'] == 'Adoption'), 'Breed'].value_counts()[0:1]

Labrador Retriever Mix    3417
Name: Breed, dtype: int64

### 2.  Changing data

#### DataFrame.applymap() and Series.map()

The ```.applymap()``` method takes a function as input that it will then apply to every entry in the dataframe.

In [104]:
def successor(x):
    return x + 1

In [109]:
successor(3.14)

4.140000000000001

In [110]:
uci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 15 columns):
age         303 non-null int64
sex         303 non-null int64
cp          303 non-null int64
trestbps    303 non-null int64
chol        303 non-null int64
fbs         303 non-null int64
restecg     303 non-null int64
thalach     303 non-null int64
exang       303 non-null int64
oldpeak     303 non-null float64
slope       303 non-null int64
ca          303 non-null int64
thal        303 non-null int64
target      303 non-null int64
newcol      303 non-null int64
dtypes: float64(1), int64(14)
memory usage: 35.6 KB

In [111]:
uci.size

4545

In [112]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,newcol
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1,2
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1,2
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1,2
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1,2
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1,2

In [116]:
type(successor)

function

In [113]:
uci.applymap(successor).head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,newcol
0,64,2,4,146,234,2,1,151,1,3.3,1,1,2,2,3
1,38,2,3,131,251,1,2,188,1,4.5,1,1,3,2,3
2,42,1,2,131,205,1,1,173,1,2.4,3,1,3,2,3
3,57,2,2,121,237,1,2,179,1,1.8,3,1,3,2,3
4,58,1,1,121,355,1,2,164,2,1.6,3,1,3,2,3

The `.map()` or `.apply()` method takes a function as input that it will then apply to every entry in the Series.

In [ ]:
uci.age.map()

In [123]:
uci['sex'].map({0: 'male', 1: 'female'}).head()

0    female
1    female
2      male
3    female
4      male
Name: sex, dtype: object

In [124]:
def decode_sex(x):
    if x == 1:
        return 'female'
    return 'male'

In [129]:
uci['sex_name'] = uci['sex'].map(decode_sex)

In [130]:
uci

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,newcol,sex_name
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1,2,female
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1,2,female
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1,2,male
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1,2,female
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1,2,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0,2,male
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0,2,female
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0,2,female
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0,2,female
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0,2,male

#### Anonymous Functions (Lambda Abstraction)

Simple functions can be defined right in the function call. This is called 'lambda abstraction'; the function thus defined has no name and hence is "anonymous".

In [ ]:
def new_round_func(x):
    return round(x)

In [131]:
uci.oldpeak

0      2.3
1      3.5
2      1.4
3      0.8
4      0.6
      ...
298    0.2
299    1.2
300    3.4
301    1.2
302    0.0
Name: oldpeak, Length: 303, dtype: float64

In [137]:
uci['newpeak'] = uci['oldpeak'].map(lambda x: f'my new peak is {x**2:.2f}!!')

In [138]:
uci

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target,newcol,sex_name,newpeak
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1,2,female,my new peak is 5.29!!
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1,2,female,my new peak is 12.25!!
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1,2,male,my new peak is 1.96!!
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1,2,female,my new peak is 0.64!!
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1,2,male,my new peak is 0.36!!
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0,2,male,my new peak is 0.04!!
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0,2,female,my new peak is 1.44!!
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0,2,female,my new peak is 11.56!!
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0,2,female,my new peak is 1.44!!
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0,2,male,my new peak is 0.00!!

Exercise: Use an anonymous function to turn the entries in age to strings

In [143]:
def squared(x): return x**2

In [144]:
squared(40)

1600

In [ ]:
x = 4

In [141]:
uci.age.map(lambda qwerty: f'age: {qwerty}')

0      age: 63
1      age: 37
2      age: 41
3      age: 56
4      age: 57
        ...
298    age: 57
299    age: 45
300    age: 68
301    age: 57
302    age: 57
Name: age, Length: 303, dtype: object

### Apply to Animal Shelter Data

Use an `apply` to change the dates from strings to datetime objects. Similarly, use an apply to change the ages of the animals from strings to floats.

In [146]:
animal_outcomes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 118000 entries, 0 to 117999
Data columns (total 12 columns):
Animal ID           118000 non-null object
Name                81031 non-null object
DateTime            118000 non-null object
MonthYear           118000 non-null object
Date of Birth       118000 non-null object
Outcome Type        117992 non-null object
Outcome Subtype     53642 non-null object
Animal Type         118000 non-null object
Sex upon Outcome    117996 non-null object
Age upon Outcome    117948 non-null object
Breed               118000 non-null object
Color               118000 non-null object
dtypes: object(12)
memory usage: 10.8+ MB

In [150]:
animal_outcomes['DateTime'] = pd.to_datetime(animal_outcomes.DateTime)
animal_outcomes['MonthYear'] = pd.to_datetime(animal_outcomes.MonthYear)

In [152]:
animal_outcomes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 118000 entries, 0 to 117999
Data columns (total 12 columns):
Animal ID           118000 non-null object
Name                81031 non-null object
DateTime            118000 non-null datetime64[ns]
MonthYear           118000 non-null datetime64[ns]
Date of Birth       118000 non-null object
Outcome Type        117992 non-null object
Outcome Subtype     53642 non-null object
Animal Type         118000 non-null object
Sex upon Outcome    117996 non-null object
Age upon Outcome    117948 non-null object
Breed               118000 non-null object
Color               118000 non-null object
dtypes: datetime64[ns](2), object(10)
memory usage: 10.8+ MB

In [155]:
animal_outcomes['Date of Birth'] = pd.to_datetime(animal_outcomes['Date of Birth'])

In [162]:
import datetime

diff = datetime.date.today() - datetime.date(2010, 5, 15)

In [165]:
diff.days / 365

10.073972602739726

In [170]:
def calculate_age(val):
    return round((datetime.datetime.now() - val).days / 365, 2)

In [172]:
calculate_age(datetime.datetime(1776, 7, 4))

244.09

In [157]:
animal_outcomes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 118000 entries, 0 to 117999
Data columns (total 12 columns):
Animal ID           118000 non-null object
Name                81031 non-null object
DateTime            118000 non-null datetime64[ns]
MonthYear           118000 non-null datetime64[ns]
Date of Birth       118000 non-null datetime64[ns]
Outcome Type        117992 non-null object
Outcome Subtype     53642 non-null object
Animal Type         118000 non-null object
Sex upon Outcome    117996 non-null object
Age upon Outcome    117948 non-null object
Breed               118000 non-null object
Color               118000 non-null object
dtypes: datetime64[ns](3), object(9)
memory usage: 10.8+ MB

In [174]:
animal_outcomes['age'] = animal_outcomes['Date of Birth'].map(calculate_age)

In [175]:
animal_outcomes

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color,age
0,A794011,Chunk,2019-05-08 18:20:00,2019-05-08 18:20:00,2017-05-02,Rto-Adopt,NaN,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Brown Tabby/White,3.10
1,A776359,Gizmo,2018-07-18 16:02:00,2018-07-18 16:02:00,2017-07-12,Adoption,NaN,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown,2.91
2,A720371,Moose,2016-02-13 17:59:00,2016-02-13 17:59:00,2015-10-08,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff,4.67
3,A674754,NaN,2014-03-18 11:47:00,2014-03-18 11:47:00,2014-03-12,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby,6.25
4,A689724,*Donatello,2014-10-18 18:52:00,2014-10-18 18:52:00,2014-08-01,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black,5.86
...,...,...,...,...,...,...,...,...,...,...,...,...,...
117995,A818200,*Baby Spice,2020-06-07 16:34:00,2020-06-07 16:34:00,2020-04-03,Adoption,NaN,Cat,Spayed Female,2 months,Domestic Shorthair,Black/White,0.18
117996,A800898,Chile Pepper,2019-07-28 17:48:00,2019-07-28 17:48:00,2006-07-28,Return to Owner,NaN,Dog,Intact Female,13 years,Chihuahua Shorthair,White/Tan,13.87
117997,A817995,*Topeka,2020-06-07 18:01:00,2020-06-07 18:01:00,2019-05-30,Adoption,NaN,Dog,Spayed Female,1 year,Labrador Retriever Mix,Brown/White,1.03
117998,A818380,NaN,2020-06-07 19:24:00,2020-06-07 19:24:00,2020-05-23,Euthanasia,Rabies Risk,Other,Unknown,2 weeks,Bat,Brown,0.04
117999,A818054,NaN,2020-06-07 19:17:00,2020-06-07 19:17:00,2019-06-01,Adoption,NaN,Dog,Spayed Female,1 year,American Staffordshire Terrier,Chocolate/White,1.02

1. clean up "Age upon outcome" into a common unit (days?)
1. make all titles lower case, and remove spaces
1. remove null values from certain columns
  - Outcome Type
  - Age upon Outcome
  - Sex upon Outcome
1. Verify DateTime == MonthYear
  - if true, drop MonthYear

In [183]:
# make all columns lower case, and remove spaces
animal_outcomes.columns = [x.replace(' ', '_').lower() for x in animal_outcomes.columns]

In [185]:
animal_outcomes.head(2)

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,age
0,A794011,Chunk,2019-05-08 18:20:00,2019-05-08 18:20:00,2017-05-02,Rto-Adopt,NaN,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Brown Tabby/White,3.10
1,A776359,Gizmo,2018-07-18 16:02:00,2018-07-18 16:02:00,2017-07-12,Adoption,NaN,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown,2.91

In [188]:
# remove null values from certain columns
# Outcome Type
# Age upon Outcome
# Sex upon Outcome
animal_outcomes = animal_outcomes.dropna(subset=['outcome_type', 'sex_upon_outcome', 'age_upon_outcome'])

In [192]:
# Verify DateTime == MonthYear
# if true, drop MonthYear
(animal_outcomes.datetime == animal_outcomes.monthyear).sum()

117942

In [193]:
animal_outcomes.shape

(117942, 13)

In [195]:
animal_outcomes = animal_outcomes.drop(columns='monthyear')

In [203]:
# clean up "Age upon outcome" into a common unit (days?)
animal_outcomes.age_upon_outcome.value_counts()

1 year       21233
2 years      17705
2 months     14128
3 years       7219
3 months      5491
1 month       5149
4 years       4260
5 years       3944
4 months      3747
5 months      2901
6 months      2828
6 years       2617
8 years       2259
7 years       2237
3 weeks       2053
2 weeks       1956
8 months      1874
10 years      1790
4 weeks       1742
10 months     1704
7 months      1514
9 years       1231
9 months      1226
12 years       879
1 weeks        794
11 months      747
11 years       703
1 week         638
13 years       563
14 years       377
3 days         337
2 days         334
15 years       319
1 day          242
6 days         232
4 days         211
0 years        177
5 days         154
16 years       135
5 weeks        112
17 years        78
18 years        48
19 years        25
20 years        17
22 years         4
-1 years         4
24 years         1
25 years         1
-3 years         1
21 years         1
Name: age_upon_outcome, dtype: int64

In [206]:
def convert_to_days_old(val):
    number, unit = val.split(' ')
    number = int(number)
    if 'year' in unit:
        return 365 * number
    if 'month' in unit:
        return 30 * number
    if 'week' in unit:
        return 7 * number
    if 'day' in unit:
        return number
    
    return 'unknown'

In [208]:
animal_outcomes['days_upon_outcome'] = animal_outcomes.age_upon_outcome.map(convert_to_days_old)

In [209]:
animal_outcomes

,animal_id,name,datetime,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,age,days_upon_outcome
0,A794011,Chunk,2019-05-08 18:20:00,2017-05-02,Rto-Adopt,NaN,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Brown Tabby/White,3.10,730
1,A776359,Gizmo,2018-07-18 16:02:00,2017-07-12,Adoption,NaN,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown,2.91,365
2,A720371,Moose,2016-02-13 17:59:00,2015-10-08,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff,4.67,120
3,A674754,NaN,2014-03-18 11:47:00,2014-03-12,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby,6.25,6
4,A689724,*Donatello,2014-10-18 18:52:00,2014-08-01,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black,5.86,60
...,...,...,...,...,...,...,...,...,...,...,...,...,...
117995,A818200,*Baby Spice,2020-06-07 16:34:00,2020-04-03,Adoption,NaN,Cat,Spayed Female,2 months,Domestic Shorthair,Black/White,0.18,60
117996,A800898,Chile Pepper,2019-07-28 17:48:00,2006-07-28,Return to Owner,NaN,Dog,Intact Female,13 years,Chihuahua Shorthair,White/Tan,13.87,4745
117997,A817995,*Topeka,2020-06-07 18:01:00,2019-05-30,Adoption,NaN,Dog,Spayed Female,1 year,Labrador Retriever Mix,Brown/White,1.03,365
117998,A818380,NaN,2020-06-07 19:24:00,2020-05-23,Euthanasia,Rabies Risk,Other,Unknown,2 weeks,Bat,Brown,0.04,14
117999,A818054,NaN,2020-06-07 19:17:00,2019-06-01,Adoption,NaN,Dog,Spayed Female,1 year,American Staffordshire Terrier,Chocolate/White,1.02,365

## 3. Methods for Re-Organizing DataFrames
#### `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [ ]:
uci.groupby('sex')

#### `.groups` and `.get_group()`

In [ ]:
uci.groupby('sex').groups

In [ ]:
uci.groupby('sex').get_group(0) # .tail()

### Aggregating

In [ ]:
uci.groupby('sex').std()

Exercise: Tell me the average cholesterol level for those with heart disease.

In [ ]:
# Your code here!

### Apply to Animal Shelter Data

#### Task 1
- Use a groupby to show the average age of the different kinds of animal types.
- What about by animal types **and** gender?

#### Task 2:
- Create new columns `year` and `month` by using a lambda function x.year on date
- Use `groupby` and `.size()` to tell me how many animals are adopted by month

In [ ]:
# Your code here

## 4. Reshaping a DataFrame

### `.pivot()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

In [ ]:
uci.pivot(values='sex', columns='target').head()

### Methods for Combining DataFrames: `.join()`, `.merge()`, `.concat()`, `.melt()`

### `.join()`

In [ ]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns = ['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns = ['age', 'HP'])

In [ ]:
toy1.join(toy2.set_index('age'),
          on = 'age',
          lsuffix = '_A',
          rsuffix = '_B').head()

### `.merge()`

In [ ]:
ds_chars = pd.read_csv('data/ds_chars.csv', index_col = 0)

In [ ]:
states = pd.read_csv('data/states.csv', index_col = 0)

In [ ]:
ds_chars.merge(states,
               left_on='home_state',
               right_on = 'state',
               how = 'inner')

### `pd.concat()`

Exercise: Look up the documentation on pd.concat (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) and use it to concatenate ds_chars and states.
<br/>
Your result should still have only five rows!

In [ ]:
pd.concat([ds_chars, states], sort=False)

### `pd.melt()`

Melting removes the structure from your DataFrame and puts the data in a 'variable' and 'value' format.

In [ ]:
ds_chars.head()

In [ ]:
pd.melt(ds_chars,
        id_vars=['name'],
        value_vars=['HP', 'home_state'])

## Bringing it all together with the Animal Shelter Data

Join the data from the [Austin Animal Shelter Intake dataset](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm) to the outcomes dataset by Animal ID.

Use the dates from each dataset to see how long animals spend in the shelter. Does it differ by time of year? By outcome?

_Hints_ :
- import and clean the intake dataset first
- use `apply`/`applymap`/`lambda` to change the variables to their proper format in the intake data
- rename the columns in the intake dataset *before* joining
- create a new `days-in-shelter` column
- Notice that some values in `days_in_shelter` are `NaN` or values < 0 (remove these rows using the "<" operator and `isna()` or `dropna()`)
- Use `groupby` to get aggregate information about the dataset (your choice)

To save your dataset:
Use the notation `df.to_csv()` or `df.to_excel()` to write the `df` to a csv. Read more about the `to_csv()` documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)

In [ ]:
#code here